---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairstypeGeomunjoinedEndCutStyle
source: html/7aebf506-a7c2-e35f-f03c-4b1e0cf64fc6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairstypeGeomunjoinedEndCutStyle Property

"Connection Method": Cut Style for Geometrically Unjoined End

## Syntax (C#)
```csharp
public static ForgeTypeId StairstypeGeomunjoinedEndCutStyle { get; }
```